# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-monoid-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"

# System Utilities
cask "betterdisplay"
cask "bleunlock"
cask "lulu"
cask "maccy"
cask "monitorcontrol"
cask "rectangle"
cask "stats"

# CLI
brew "bat"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "htop"
brew "jq"
brew "just"
brew "mas"
brew "mole"
brew "rclone"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "tree"
brew "wget"
brew "xz"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"

# Productivity
cask "appcleaner"
cask "obsidian"
cask "onyx"
cask "sublime-text"
cask "the-unarchiver"

# Browsers
cask "brave-browser"
cask "google-chrome"
cask "helium-browser"

# Development
brew "awscli"
brew "deno"
brew "gh"
brew "git"
brew "go"
brew "node"
brew "oven-sh/bun/bun"
brew "pnpm"
brew "python"
brew "rustup"
brew "uv"
cask "claude-code"
cask "docker-desktop"
cask "ghostty"
cask "insomnia"
cask "visual-studio-code"

# App Store Apps
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
